Revit 2027 API
TopographySurface.IsSiteSubRegion Property
 Identifies if this element represents a subregion.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSiteSubRegion { get; }
Public ReadOnly Property IsSiteSubRegion As Boolean
	Get
public:
property bool IsSiteSubRegion {
	bool get ();
}
member IsSiteSubRegion : bool with get
Property Value
Boolean
See Also
Reference
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace